[Killed] Equality mutation
GildedRose.cs:14:29
 
         public void UpdateQuality()
         {
-            for (int i = 0; i < Items.Length; i++)
+            for (int i = 0; i <= Items.Length; i++)
             {
                 if (Items[i].Name != "Aged Brie"

[Killed] Equality mutation
GildedRose.cs:14:29
 
         public void UpdateQuality()
         {
-            for (int i = 0; i < Items.Length; i++)
+            for (int i = 0; i > Items.Length; i++)
             {
                 if (Items[i].Name != "Aged Brie"

[Killed] Negate expression
GildedRose.cs:16:21
         {
             for (int i = 0; i < Items.Length; i++)
             {
-                if (Items[i].Name != "Aged Brie"
-                        && Items[i].Name != "Backstage passes to a TAFKAL80ETC concert")
+                if (!(Items[i].Name != "Aged Brie"
+                        && Items[i].Name != "Backstage passes to a TAFKAL80ETC concert"))
                 {
                     if (Items[i].Quality > 0)

[Killed] Equality mutation
GildedRose.cs:16:21
         {
             for (int i = 0; i < Items.Length; i++)
             {
-                if (Items[i].Name != "Aged Brie"
+                if (Items[i].Name == "Aged Brie"
+
                         && Items[i].Name != "Backstage passes to a TAFKAL80ETC concert")
                 {

[Killed] Equality mutation
GildedRose.cs:17:28
             for (int i = 0; i < Items.Length; i++)
             {
                 if (Items[i].Name != "Aged Brie"
-                        && Items[i].Name != "Backstage passes to a TAFKAL80ETC concert")
+                        && Items[i].Name == "Backstage passes to a TAFKAL80ETC concert")
                 {
                     if (Items[i].Quality > 0)

[Killed] Negate expression
GildedRose.cs:35:33
 
                         if (Items[i].Name == "Backstage passes to a TAFKAL80ETC concert")
                         {
-                            if (Items[i].SellIn < 11)
+                            if (!(Items[i].SellIn < 11))
                             {
                                 if (Items[i].Quality < 50)

[Killed] Equality mutation
GildedRose.cs:43:33
                                 }
                             }
 
-                            if (Items[i].SellIn < 6)
+                            if (Items[i].SellIn > 6)
                             {
                                 if (Items[i].Quality < 50)

[Killed] Equality mutation
GildedRose.cs:59:21
                     Items[i].SellIn = Items[i].SellIn - 1;
                 }
 
-                if (Items[i].SellIn < 0)
+                if (Items[i].SellIn <= 0)
                 {
                     if (Items[i].Name != "Aged Brie")
